content/notes/20210830181701-my_projects.md
+++
title = "My projects"
author = ["Бадыков Айрат"]
draft = false
+++

## [Rust]({{<relref "20210830224139-rust.md#" >}}) {#rust--20210830224139-rust-dot-md}

-   [El Monitorro]({{<relref "20210109164238-el_monitorro.md#" >}}) - Telegram bot for reading feeds in Rust

-   [Fang]({{<relref "20210830182841-fang.md#" >}}) - Background processing library in Rust

-   [Frankenstein]({{<relref "20210830183352-frankenstein.md#" >}}) - Telegram client for Rust

-   [Cronenberg]({{<relref "20210831083052-cronenberg.md#" >}}) - Simple cron command entry parser in Rust


## Elixir {#elixir}

-   [Mana]({{<relref "20210830184907-mana.md#" >}}) - Ethereum implementation in Elixir

-   [Blockscout]({{<relref "20210830185320-blockscout.md#" >}}) - Ethereum explorer

-   [ExRLP]({{<relref "20210831143205-exrlp.md#" >}}) - Elixir implementation of Ethereum's RLP (Recursive Length Prefix) encoding

-   [ExABI]({{<relref "20210831151627-exabi.md#" >}}) - The Application Binary Interface (ABI) of Solidity for Elixir

-   [ExSecp256k1]({{<relref "20210831153203-exsecp256k1.md#" >}}) - Libsecp256k1 NIF

-   [Ethereumex]({{<relref "20210902194855-ethereumex.md#" >}}) - Elixir JSON-RPC client for the Ethereum blockchain

-   [BN]({{<relref "20210831153758-bn.md#" >}}) - BN128 elliptic curve operations for Elixir.

-   [Hornet]({{<relref "20210831155211-hornet.md#" >}}) - Simple library for stress testing

-   [CLOPE](https://github.com/ayrat555/clope) - Elixir implementation of CLOPE

    A Fast and Effective Clustering Algorithm for Transactional Data

-   [ROCK](https://github.com/ayrat555/rock) - Elixir implementation of ROCK

    A Robust Clustering Algorithm for Categorical Attributes

-   [EthBloom](https://github.com/ayrat555/eth%5Fbloom) - Ethereum's bloom filter implementation in elixir, integrated in Mana

-   [UploadcareEx](https://github.com/CryptoHamsters/uploadcare%5Fex) - Simple Elixir wrapper for Uploadcare API

-   [BalalaikaBear](https://github.com/BalalaikaIndustries/balalaika%5Fbear) - VK API wrapper for Elixir

-   [ExRiakCS](https://github.com/ayrat555/ex%5Friak%5Fcs) - Riak CS API wrapper for Elixir


## [My emacs projects]({{<relref "20210901190330-my_emacs_projects.md#" >}}) {#my-emacs-projects--20210901190330-my-emacs-projects-dot-md}


## Games {#games}

-   [Life Balance]({{<relref "20210901191515-life_balance.md#" >}})

If you like my work, consider [donating]({{<relref "20210901185649-donations.md#" >}})
